AccumulationRegisters/РасчетыПоЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЗаказам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОбеспечениеЗаказовРозницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОбеспечениеЗаказовРозницы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПоФакту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комната</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныМатериаловПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныМатериаловПоставщиков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаСФотопечатью</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦеныПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦенПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фактура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦветФактуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПоставщиков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦеныПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦенПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВЕдиницахДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Замена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыСпецификации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СпецификацияПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СопутствующиеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплектация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОбработкаТабличныхЧастейСервер/Ext/Module.bsl
#Область Общее

Процедура ПересчитатьПроцентРучнойСкидкиВСтрокеТЧ(ТекущаяСтрока, ИмяРеквизитаПроцентРучнойСкидки=Неопределено, ИмяРеквизитаСуммаРучнойСкидки=Неопределено) Экспорт
		
	ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьПроцентРучнойСкидкиВСтрокеТЧ(ТекущаяСтрока, ИмяРеквизитаПроцентРучнойСкидки, ИмяРеквизитаСуммаРучнойСкидки);

КонецПроцедуры

Процедура ПересчитатьСуммуРучнойСкидкиВСтрокеТЧ(ТекущаяСтрока) Экспорт
	
	ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуРучнойСкидкиВСтрокеТЧ(ТекущаяСтрока);
	
КонецПроцедуры

Процедура ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(ТекущаяСтрока, ИспользуютсяАвтоматическиеСкидки, ИспользуютсяСкидки = Истина, ИспользуютсяБонусы = Ложь) Экспорт
	
	ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(ТекущаяСтрока, ИспользуютсяАвтоматическиеСкидки, , ИспользуютсяСкидки, ИспользуютсяБонусы);

КонецПроцедуры

Процедура ОкруглитьСтрокуТЧ(СтрокаДокумента, ПорядокОкругления, ОкруглятьВБольшуюСторону, ВариантОкругления,
	ИмяРеквизитаПроцентРучнойСкидки = Неопределено, 
	ИмяРеквизитаСуммаРучнойСкидки = Неопределено,
	ИспользуютсяАвтоматическиеСкидки = Ложь) Экспорт
	
	ОбработкаТабличныхЧастейКлиентСервер.ОкруглитьСтрокуТЧ(СтрокаДокумента, ПорядокОкругления, ОкруглятьВБольшуюСторону, ВариантОкругления,
				ИмяРеквизитаПроцентРучнойСкидки, 
				ИмяРеквизитаСуммаРучнойСкидки,
				ИспользуютсяАвтоматическиеСкидки);
	
КонецПроцедуры

Процедура ПроверитьЦенуСтроки(ТекущаяСтрока, СтруктураПараметров, Отказ = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Цена) Тогда
		Если НЕ ТекущаяСтрока.Бесплатно И НЕ ТекущаяСтрока.Номенклатура.РазрешитьПродажуПоНулевойЦене Тогда
			
			ПутьКТабличнойЧасти = "";
			НомерСтроки = 0;
			Если СтруктураПараметров.Свойство("НомерСтроки", НомерСтроки) Тогда 
				НомерСтроки = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
				ПутьКТабличнойЧасти = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(СтруктураПараметров.ТабличнаяЧасть, НомерСтроки, "Цена");
			КонецЕсли;
			ТекстСообщения = "";
			Если НЕ СтруктураПараметров.Свойство("ТекстСообщения", ТекстСообщения) Тогда 
				ТекстСообщения = "В табличной части """ + СтруктураПараметров.ИмяТабличнойЧасти + """ в строке " + (НомерСтроки) + " не заполнено значение колонки ""Цена""";
			КонецЕсли;
						
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				СтруктураПараметров.Ссылка,
				ПутьКТабличнойЧасти,
				,
				Отказ);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС) Экспорт
	
	ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);

КонецПроцедуры

Процедура ЗаполнитьСтавкуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, СтавкаНДСПоУмолчанию, УчитыватьНДС) Экспорт

	ОбработкаТабличныхЧастейКлиентСервер.ЗаполнитьСтавкуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, СтавкаНДСПоУмолчанию, УчитыватьНДС);
	
КонецПроцедуры

Процедура НазначитьРучнуюСкидку(Объект, ИмяТЧ, Знач СуммаСкидкиКРаспределению, ИспользуютсяАвтоматическиеСкидки, УчитыватьНДС) Экспорт
	
	МаксимальнаяСуммаСкидки = 0;
	Для Каждого СтрокаТЧ Из Объект[ИмяТЧ] Цикл
		
		СуммаАвтоматическойСкидки = 0;
		Если ИспользуютсяАвтоматическиеСкидки Тогда
			СуммаАвтоматическойСкидки = СтрокаТЧ.СуммаАвтоматическойСкидки;
		КонецЕсли;
		//Если ЕстьБонусы Тогда
		//	СуммаАвтоматическойСкидки = СуммаАвтоматическойСкидки + СтрокаТЧ.СуммаСкидкиОплатыБонусом;
		//КонецЕсли;
		МаксимальнаяСуммаСкидки = МаксимальнаяСуммаСкидки + СтрокаТЧ.Количество * СтрокаТЧ.Цена - СуммаАвтоматическойСкидки;
		
	КонецЦикла;
	
	Если СуммаСкидкиКРаспределению > МаксимальнаяСуммаСкидки Тогда
		СуммаСкидкиКРаспределению = МаксимальнаяСуммаСкидки;
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из Объект[ИмяТЧ] Цикл
				
		СуммаБезСкидки = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
		СуммаАвтоматическойСкидки = 0;
		Если ИспользуютсяАвтоматическиеСкидки Тогда
			СуммаАвтоматическойСкидки = СтрокаТЧ.СуммаАвтоматическойСкидки;
		КонецЕсли;
		//Если ЕстьБонусы Тогда
		//	СуммаАвтоматическойСкидки = СуммаАвтоматическойСкидки + СтрокаТЧ.СуммаСкидкиОплатыБонусом;
		//КонецЕсли;
		
		Если МаксимальнаяСуммаСкидки <> 0 Тогда
			СтрокаТЧ.СуммаРучнойСкидки = (СуммаБезСкидки - СуммаАвтоматическойСкидки) * (СуммаСкидкиКРаспределению / МаксимальнаяСуммаСкидки);
		Иначе
			СтрокаТЧ.СуммаРучнойСкидки = 0;
		КонецЕсли;
		СуммаСкидкиКРаспределению = СуммаСкидкиКРаспределению - СтрокаТЧ.СуммаРучнойСкидки;
		МаксимальнаяСуммаСкидки = МаксимальнаяСуммаСкидки - (СуммаБезСкидки - СуммаАвтоматическойСкидки);
		
		Если СуммаБезСкидки <> 0 Тогда
			СтрокаТЧ.ПроцентРучнойСкидки = 100 * СтрокаТЧ.СуммаРучнойСкидки / СуммаБезСкидки;
		Иначе
			СтрокаТЧ.ПроцентРучнойСкидки = 0;
		КонецЕсли;
		
		СуммаСкидки = СуммаАвтоматическойСкидки + СтрокаТЧ.СуммаРучнойСкидки;
		
		Если ИспользуютсяАвтоматическиеСкидки Тогда
			Если СуммаБезСкидки <> 0 Тогда
				СтрокаТЧ.ПроцентАвтоматическойСкидки = ?(СуммаБезСкидки = 0, 0 , 100 * СуммаАвтоматическойСкидки / СуммаБезСкидки);
			Иначе
				СтрокаТЧ.ПроцентАвтоматическойСкидки = 0;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаТЧ.Сумма    = СуммаБезСкидки - ?(СуммаСкидки > СуммаБезСкидки, СуммаБезСкидки, СуммаСкидки);
		ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТЧ, УчитыватьНДС);
		
	КонецЦикла;
	
	Объект.СуммаДокумента = Объект[ИмяТЧ].Итог("Сумма");
	
КонецПроцедуры

Процедура ОтменитьРучныеСкидки(Объект, ИмяТЧ, ИспользуютсяАвтоматическиеСкидки, УчитыватьНДС) Экспорт
	
	Для Каждого СтрокаТЧ Из Объект[ИмяТЧ] Цикл
		
		СтрокаТЧ.СуммаРучнойСкидки   = 0;
		СтрокаТЧ.ПроцентРучнойСкидки = 0;
		
		СуммаБезСкидки = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
		
		СуммаАвтоматическойСкидки = 0;
		Если ИспользуютсяАвтоматическиеСкидки Тогда
			СуммаАвтоматическойСкидки = СтрокаТЧ.СуммаАвтоматическойСкидки;
		КонецЕсли;

		//Если ЕстьБонусы Тогда
		//	СуммаАвтоматическойСкидки = СуммаАвтоматическойСкидки + СтрокаТЧ.СуммаСкидкиОплатыБонусом;
		//КонецЕсли;
		
		СтрокаТЧ.Сумма    = СуммаБезСкидки - ?(СуммаАвтоматическойСкидки > СуммаБезСкидки, СуммаБезСкидки, СуммаАвтоматическойСкидки);
		ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТЧ, УчитыватьНДС);
		
	КонецЦикла;
	
	Объект.СуммаДокумента = Объект[ИмяТЧ].Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаТабличныхЧастей_Розница

#КонецОбласти

#Область ОбработкаТабличныхЧастей_ЗаказДоговор

Функция ДобавитьОбновитьПотолокВТЧДокументаРозницы(ДанныеФормы, ИмяТабличнойЧасти, ДанныеСтроки) Экспорт
	
	ОтборСтрока = Новый Структура("Комната, Номенклатура", ДанныеСтроки.Комната, ДанныеСтроки.Номенклатура);
	
	ТабличнаяЧастьДокумента = ДанныеФормы[ИмяТабличнойЧасти];	
	МетаданныеДокумента = ДанныеФормы.Ссылка.Метаданные(); // заказ-договор / предварительный расчет / монтаж	
	Если ОбщийМодуль.ЕстьРеквизитТабЧастиОбъекта("ЗагруженоИзПостроителя", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда		
		ОтборСтрока.Вставить("ЗагруженоИзПостроителя", Истина);
	КонецЕсли;
		
	НайденнаяСтрока = ТабличнаяЧастьДокумента.НайтиСтроки(ОтборСтрока);
	Если НайденнаяСтрока.Количество() > 0 Тогда
		НоваяСтрокаДокумента = НайденнаяСтрока[0];
	Иначе
		//НоваяСтрокаДокумента = ТабличнаяЧастьДокумента.Добавить();							
		//Нужно указать индекс чтобы вставить в нужную комнату
		ОтборИндекс = Новый Структура("Комната", ДанныеСтроки.Комната);
		НайтиИндексКомнаты = ТабличнаяЧастьДокумента.НайтиСтроки(ОтборИндекс);
		Если НайтиИндексКомнаты.Количество() > 0 Тогда
			ИндексКомнаты = НайтиИндексКомнаты[НайтиИндексКомнаты.Количество()-1].НомерСтроки;
			НоваяСтрокаДокумента = ТабличнаяЧастьДокумента.Вставить(ИндексКомнаты);					
		Иначе	
			НоваяСтрокаДокумента = ТабличнаяЧастьДокумента.Добавить();					
		КонецЕсли;	
	КонецЕсли;
				
	ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента, ДанныеСтроки);	
	
	Возврат НоваяСтрокаДокумента;
	
КонецФункции

Функция ДобавитьОбновитьСтрокуВТЧЗаказДоговора(ТабличнаяЧастьДокумента, СтрокаТЧИсточник, ДополнительныеДанныеСтроки) Экспорт
	
	ОтборСтрока = Новый Структура("Комната, Номенклатура, НомерПотолка, ЗагруженоИзПостроителя", ДополнительныеДанныеСтроки.Комната, СтрокаТЧИсточник.Номенклатура, ДополнительныеДанныеСтроки.НомерПотолка, Истина);
	НайденнаяСтрока = ТабличнаяЧастьДокумента.НайтиСтроки(ОтборСтрока);
	
	Если НайденнаяСтрока.Количество() > 0 Тогда
		НоваяСтрокаДокумента = НайденнаяСтрока[0];
	Иначе
		//НоваяСтрокаДокумента = ТабличнаяЧастьДокумента.Добавить();
		//Нужно указать индекс чтобы вставить в нужную комнату
		ОтборИндекс = Новый Структура("Комната", ДополнительныеДанныеСтроки.Комната);
		НайтиИндексКомнаты = ТабличнаяЧастьДокумента.НайтиСтроки(ОтборИндекс);
		Если НайтиИндексКомнаты.Количество() > 0 Тогда
			ИндексКомнаты = НайтиИндексКомнаты[НайтиИндексКомнаты.Количество()-1].НомерСтроки;
			НоваяСтрокаДокумента = ТабличнаяЧастьДокумента.Вставить(ИндексКомнаты);					
		Иначе	
			НоваяСтрокаДокумента = ТабличнаяЧастьДокумента.Добавить();					
		КонецЕсли;
	КонецЕсли;
				
	ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента, СтрокаТЧИсточник);
	НоваяСтрокаДокумента.Спецификация = ОбщийМодульВызовСервера.ПолучитьОсновнуюСпецификациюНоменклатуры(НоваяСтрокаДокумента.Номенклатура, Перечисления.ВидыСпецификации.СопутствующиеМатериалы);
	ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента, ДополнительныеДанныеСтроки);
	
	Возврат НоваяСтрокаДокумента;
	
КонецФункции

Процедура ОбработатьЗагрузкуМатериаловВДокументРозницы(НоменклатураПотолок, Комната, ТЧМатериалы, ТЧМатериалыСлужебная=Неопределено, ТЧМатериалыИсточник) Экспорт
	
	Для Каждого ТекМатериал Из ТЧМатериалыИсточник Цикл
		Если ТекМатериал.РезультатРасширеннойОбработки Тогда
			
			ОтборСтрок = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЗагруженоИзПостроителя, Потолок, Комната, КлючУникальности", 
										ТекМатериал.Номенклатура, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), Истина, НоменклатураПотолок, Комната, ТекМатериал.КлючУникальности);
			
			КоличествоСлужебная = 0;
			Если НЕ ТЧМатериалыСлужебная = Неопределено Тогда
				НайденныеСтроки = ТЧМатериалыСлужебная.НайтиСтроки(ОтборСтрок);
				Если НайденныеСтроки.Количество() > 0 Тогда
					КоличествоСлужебная = НайденныеСтроки[0].Количество;
				КонецЕсли;
			КонецЕсли;
		
			ОтборСтрок = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, Комната", 
										ТекМатериал.Номенклатура, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), Комната);
			
			НайденныеСтроки = ТЧМатериалы.НайтиСтроки(ОтборСтрок);
			Если НайденныеСтроки.Количество() > 0 Тогда
				НоваяСтрока = НайденныеСтроки[0];
				НоваяСтрока.Количество = НайденныеСтроки[0].Количество - КоличествоСлужебная + ТекМатериал.Количество;
			Иначе
				НоваяСтрока = ТЧМатериалы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекМатериал);
				НоваяСтрока.Комната = Комната;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ТЧМатериалыСлужебная = Неопределено Тогда	
		Колво = ТЧМатериалыСлужебная.Количество();	
		Для Инд = 1 По Колво Цикл
			Если ТЧМатериалыСлужебная[Колво - Инд].Комната = Комната И ТЧМатериалыСлужебная[Колво - Инд].Потолок = НоменклатураПотолок Тогда
				ТЧМатериалыСлужебная.Удалить(Колво - Инд);
			КонецЕсли;
		КонецЦикла;
		Для каждого ТекМатериал Из ТЧМатериалыИсточник Цикл
			НоваяСтрока = ТЧМатериалыСлужебная.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекМатериал);
			НоваяСтрока.Комната = Комната;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроставитьИРассчитатьДанныеПоПрайсу(ТекущаяСтрока) Экспорт
	
	ОбработкаТабличныхЧастейКлиентСервер.ПроставитьИРассчитатьДанныеПоПрайсу(ТекущаяСтрока);	
	
КонецПроцедуры

#КонецОбласти


#Область ОбработкаТабличныхЧастей_Монтаж

Процедура ОбработатьЗагрузкуМатериаловВМонтаж(НоменклатураПотолок, Комната, ТЧМатериалы, ТЧМатериалыИсточник) Экспорт
	
	Для Каждого ТекМатериал Из ТЧМатериалыИсточник Цикл
		Если ТекМатериал.РезультатРасширеннойОбработки Тогда
			
			ОтборСтрок = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, Комната", 
										ТекМатериал.Номенклатура, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), Комната);
			
			НайденныеСтроки = ТЧМатериалы.НайтиСтроки(ОтборСтрок);
			Если НайденныеСтроки.Количество() > 0 Тогда
				НоваяСтрока = НайденныеСтроки[0];
				НоваяСтрока.Количество = НоваяСтрока.Количество + ТекМатериал.Количество;
			Иначе
				НоваяСтрока = ТЧМатериалы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекМатериал);
				НоваяСтрока.Комната = Комната;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
			
КонецПроцедуры

#КонецОбласти

#Область ОбработкаТабличныхЧастей_ЗаказПокупателя

Функция ДобавитьОбновитьПотолокВТЧЗаказПокупателя(ТабличнаяЧастьДокумента, СтрокаДокумента, ДанныеСтроки, Знач УИСтроки = Неопределено) Экспорт
	
	Если УИСтроки = Неопределено Тогда
		УИСтроки = "";
	КонецЕсли;
	
	//Если СтрокаДокумента = Неопределено Тогда
	//	НоваяСтрокаДокумента = ТабличнаяЧастьДокумента.Добавить();
	//Иначе
	//	НоваяСтрокаДокумента = СтрокаДокумента;
	//КонецЕсли;
	
	//ОтборСтрока = Новый Структура("Номенклатура, ЗагруженоИзПостроителя", ДанныеСтроки.Номенклатура, Истина);
	ОтборСтрока = Новый Структура;
	ОтборСтрока.Вставить("Номенклатура", ДанныеСтроки.Номенклатура);
	ОтборСтрока.Вставить("УИСтроки", УИСтроки);
	НайденнаяСтрока = ТабличнаяЧастьДокумента.НайтиСтроки(ОтборСтрока);
	Если НайденнаяСтрока.Количество() > 0 Тогда
		НоваяСтрокаДокумента = НайденнаяСтрока[0];
	Иначе
		НоваяСтрокаДокумента = ТабличнаяЧастьДокумента.Добавить();					
	КонецЕсли;
				
	ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента, ДанныеСтроки);
	НоваяСтрокаДокумента.УИСтроки = УИСтроки;
	
	Возврат НоваяСтрокаДокумента;
	
КонецФункции

Функция ДобавитьОбновитьСтрокуВТЧЗаказПокупателя(ТабличнаяЧастьДокумента, СтрокаТЧИсточник, ДополнительныеДанныеСтроки, ВставитьПередНомерСтроки = Неопределено, ИзменятьВыработку = Ложь) Экспорт
	
	ОтборСтрока = Новый Структура("Номенклатура, Потолок, ЗагруженоИзПостроителя", СтрокаТЧИсточник.Номенклатура, ДополнительныеДанныеСтроки.Потолок, Истина);
	НайденнаяСтрока = ТабличнаяЧастьДокумента.НайтиСтроки(ОтборСтрока);
	
	Если НайденнаяСтрока.Количество() > 0 Тогда
		НоваяСтрокаДокумента = НайденнаяСтрока[0];
	Иначе
		//++ №14059 добавлена вставка после позициции
		//НоваяСтрокаДокумента = ТабличнаяЧастьДокумента.Добавить();
		НоваяСтрокаДокумента = ?(ВставитьПередНомерСтроки = Неопределено, ТабличнаяЧастьДокумента.Добавить(), ТабличнаяЧастьДокумента.Вставить(ВставитьПередНомерСтроки));
		//-- №14059
	КонецЕсли;
				
	ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента, СтрокаТЧИсточник);
	ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента, ДополнительныеДанныеСтроки);
	
	Если ИзменятьВыработку Тогда
		НоваяСтрокаДокумента.КоличествоКВыработке = НоваяСтрокаДокумента.Количество; // №14311
	КонецЕсли;
	
	Возврат НоваяСтрокаДокумента;
	
КонецФункции

Процедура ОкруглитьСтоимостьПотолковВЗаказеПокупателя(ТабличнаяЧастьДокумента, НоменклатураПотолка) Экспорт
	
	ПорядокОкругления = Константы.ПорядокОкругленияЧисломСтоимостиПотолков.Получить();
	//ТребуетсяОкругление = НЕ ПорядокОкругления = Перечисления.ПорядкиОкругления.ПустаяСсылка();
	//ТребуетсяОкругление = (ПорядокОкругления > 0);
	ТребуетсяОкругление = Константы.ОкруглятьСтоимостьПотолка.Получить() И (ПорядокОкругления > 0);
	Если ТребуетсяОкругление Тогда		
		ОкруглятьВБольшуюСторону = Константы.ОкруглятьВБольшуюСторонуСтоимостьПотолков.Получить();
		СпособОкругления = Константы.СпособОкругленияСтоимостиПотолков.Получить();
		ВариантОкругления = Константы.ВариантОкругленияСтоимостиПотолков.Получить();
		ТребуетсяОкруглениеСоставляющих = ТребуетсяОкругление И СпособОкругления = 1;
		ТребуетсяОкруглениеПотолка    = ТребуетсяОкругление И СпособОкругления = 0;
		НайденныеСтроки = ТабличнаяЧастьДокумента.НайтиСтроки(Новый Структура("Потолок", НоменклатураПотолка));
		
		Если ТребуетсяОкруглениеСоставляющих Тогда
			Для каждого СтрокаТЧ из НайденныеСтроки Цикл
				ОбработкаТабличныхЧастейСервер.ОкруглитьСтрокуТЧ(СтрокаТЧ, ПорядокОкругления, ОкруглятьВБольшуюСторону, ВариантОкругления, "ПроцентРучнойСкидки", "СуммаРучнойСкидки");
			КонецЦикла;
		ИначеЕсли ТребуетсяОкруглениеПотолка Тогда
			ИтоговаяСуммаПотолка = 0;
			Для каждого СтрокаТЧ из НайденныеСтроки Цикл
				ИтоговаяСуммаПотолка = ИтоговаяСуммаПотолка + СтрокаТЧ.Сумма;
			КонецЦикла;
			ОкругленнаяИтоговаяСуммаПотолка = ОбщийМодуль.ОкруглитьЧисло(ИтоговаяСуммаПотолка, ПорядокОкругления, ОкруглятьВБольшуюСторону);
			НайденнаяСтрокаПотолка = ТабличнаяЧастьДокумента.НайтиСтроки(Новый Структура("Номенклатура", НоменклатураПотолка));
			Если НайденнаяСтрокаПотолка.Количество() > 0  Тогда
				НайденнаяСтрокаПотолка[0].Сумма = НайденнаяСтрокаПотолка[0].Сумма - (ИтоговаяСуммаПотолка - ОкругленнаяИтоговаяСуммаПотолка); 
				
				Если ВариантОкругления = 0 Тогда
					//изменять цену после округления
					Если НЕ НайденнаяСтрокаПотолка[0].Количество = 0 Тогда
						СуммаБезСкидки = НайденнаяСтрокаПотолка[0].Сумма + НайденнаяСтрокаПотолка[0].СуммаРучнойСкидки;
						НайденнаяСтрокаПотолка[0].Цена = Окр(СуммаБезСкидки / НайденнаяСтрокаПотолка[0].Количество, 2);
					КонецЕсли;
				Иначе
					//изменять сумму ручной скидки
					НайденнаяСтрокаПотолка[0].СуммаРучнойСкидки = НайденнаяСтрокаПотолка[0].СуммаРучнойСкидки + (ИтоговаяСуммаПотолка - ОкругленнаяИтоговаяСуммаПотолка);
					ОбработкаТабличныхЧастейСервер.ПересчитатьПроцентРучнойСкидкиВСтрокеТЧ(НайденнаяСтрокаПотолка[0], "ПроцентРучнойСкидки", "СуммаРучнойСкидки");					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработкаТабличныхЧастей_ЗаказНаПроизводство

Функция ДобавитьОбновитьСтрокуВТЧЗаказНаПроизводство(ТабличнаяЧастьДокумента, СтрокаТЧИсточник, ДополнительныеДанныеСтроки) Экспорт
	
	ОтборСтрока = Новый Структура("Номенклатура, ЗагруженоИзПостроителя", СтрокаТЧИсточник.Номенклатура, Истина);
	НайденнаяСтрока = ТабличнаяЧастьДокумента.НайтиСтроки(ОтборСтрока);
	
	Если НайденнаяСтрока.Количество() > 0 Тогда
		НоваяСтрокаДокумента = НайденнаяСтрока[0];
	Иначе
		НоваяСтрокаДокумента = ТабличнаяЧастьДокумента.Добавить();					
	КонецЕсли;
				
	ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента, СтрокаТЧИсточник);
	ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента, ДополнительныеДанныеСтроки);
	
	Возврат НоваяСтрокаДокумента;
	
КонецФункции
	
#КонецОбласти


#Область ОбработкаТабличныхЧастей_РаспределениеПлатежа

// Используется в документах распределения сумм по заказам
//
// Параметры:
//  СтрокиРаспределения		 - Массив					 - массив структур со строками табличной части
//  СуммаКРаспределению		 - Число			 		 - доступная к распределению сумма
//  ДатаОплаты	 			 - Дата	 					 - дата распределения
//  ВалютаОплаты	 		 - СправочникСсылка.Валюта	 - валюта
//
Процедура РаспределитьСуммуОплатыПоДокументам(СтрокиРаспределения, СуммаКРаспределению, Знач ДатаОплаты = Неопределено, Знач ВалютаОплаты = Неопределено) Экспорт
	
	Если СтрокиРаспределения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ДатаОплаты = Неопределено Тогда
		ДатаОплаты = ТекущаяДатаСеанса();
	КонецЕсли;
	Если ВалютаОплаты = Неопределено Тогда
		ВалютаОплаты = Константы.ВалютаУчета.Получить();
	КонецЕсли;
	
	//ТЗТабличнаяЧастьДокумента = ТабличнаяЧастьДокумента.Выгрузить();
	
	// (ТабличнаяЧастьДокумента) = ("Массив")
	
	ТЗТабличнаяЧастьДокумента = ОбщийМодульСервер.ПреобразоватьМассивВТаблицуЗначений(СтрокиРаспределения, Истина);		
	МассивДокументовРаспределения = ТЗТабличнаяЧастьДокумента.ВыгрузитьКолонку("Документ"); //ТабличнаяЧастьДокумента.Выгрузить(,"Документ");
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЧ", ТЗТабличнаяЧастьДокумента); //ТабличнаяЧастьДокумента.Выгрузить());
	Запрос.УстановитьПараметр("МассивДокументовРаспределения", МассивДокументовРаспределения);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Документ КАК Документ
	|ПОМЕСТИТЬ ВТ_ТаблицаДокументов
	|ИЗ
	|	&ТЧ КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТаблицаДокументов.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаДокументов.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОсталосьРаспределить,
	|	0 КАК Сумма,
	|	ПРЕДСТАВЛЕНИЕ(ТИПЗНАЧЕНИЯ(ВТ_ТаблицаДокументов.Документ)) КАК ТипДокумента,
	|	РасчетыПоЗаказамОстатки.Заказ.Валюта КАК Валюта
	|ИЗ
	|	ВТ_ТаблицаДокументов КАК ВТ_ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Остатки(, Заказ В (&МассивДокументовРаспределения)) КАК РасчетыПоЗаказамОстатки
	|		ПО (РасчетыПоЗаказамОстатки.Заказ = ВТ_ТаблицаДокументов.Документ)
	|где не ВТ_ТаблицаДокументов.Документ = неопределено
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ТаблицаПоДокументам = Запрос.Выполнить().Выгрузить();
	ТипыДокументов = ТаблицаПоДокументам.ВыгрузитьКолонку("ТипДокумента");
	
	//пройдем по всем строкам запроса и сконвертируем суммы в валюту платежа
	Для Каждого ТекущаяСтрока Из ТаблицаПоДокументам Цикл
		Если НЕ ВалютаОплаты = ТекущаяСтрока.Валюта Тогда
			ТекущаяСтрока.ОсталосьРаспределить = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ТекущаяСтрока.Валюта, ВалютаОплаты, ДатаОплаты, ТекущаяСтрока.ОсталосьРаспределить); 
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ЭлементТипДокумента из ТипыДокументов Цикл
		НайденныеСтроки = ТаблицаПоДокументам.НайтиСтроки(Новый Структура("ТипДокумента", ЭлементТипДокумента));
		СуммаРаспределения = СуммаКРаспределению;
		Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
			СуммаРаспределенияПоДокументу = Мин(СуммаРаспределения, НайденнаяСтрока.ОсталосьРаспределить);
			ТЗТабличнаяЧастьДокумента[НайденнаяСтрока.НомерСтроки - 1].Сумма = СуммаРаспределенияПоДокументу;
			Если НайденнаяСтрока.Валюта = ВалютаОплаты Тогда
				ТЗТабличнаяЧастьДокумента[НайденнаяСтрока.НомерСтроки - 1].СуммаВВалютеДокумента = СуммаРаспределенияПоДокументу;
			Иначе
				ТЗТабличнаяЧастьДокумента[НайденнаяСтрока.НомерСтроки - 1].СуммаВВалютеДокумента = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВалютаОплаты, ТЗТабличнаяЧастьДокумента[НайденнаяСтрока.НомерСтроки - 1].Документ.Валюта, ДатаОплаты, СуммаРаспределенияПоДокументу);
			КонецЕсли;
			СуммаРаспределения = СуммаРаспределения - СуммаРаспределенияПоДокументу;
		КонецЦикла;
	КонецЦикла;
	
	СтрокиРаспределения = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗТабличнаяЧастьДокумента);
	
КонецПроцедуры

Процедура РаспределитьПереплатуНаПоследнийДокумент(ТабличнаяЧастьДокумента, ОбщаяСуммаКРаспределению, Знач ДатаОплаты = Неопределено, Знач ВалютаОплаты = Неопределено) Экспорт
	
	Если ДатаОплаты = Неопределено Тогда
		ДатаОплаты = ТекущаяДатаСеанса();
	КонецЕсли;
	Если ВалютаОплаты = Неопределено Тогда
		ВалютаОплаты = Константы.ВалютаУчета.Получить();
	КонецЕсли;
	
	ТЗТабличнаяЧастьДокумента = ТабличнаяЧастьДокумента.Выгрузить();
	ТЗТабличнаяЧастьДокумента.Колонки.Добавить("ТипДокумента");
	Для каждого ЭлементТЗ из ТЗТабличнаяЧастьДокумента Цикл
		ЭлементТЗ.ТипДокумента = ТипЗнч(ЭлементТЗ.Документ);
	КонецЦикла;
	
	ТЗТипыДокументов = ТЗТабличнаяЧастьДокумента.Скопировать(, "ТипДокумента");
	ТЗТипыДокументов.Свернуть("ТипДокумента");
	Для каждого ЭлементТипДокумента из ТЗТипыДокументов Цикл
		НайденныеСтроки = ТЗТабличнаяЧастьДокумента.НайтиСтроки(Новый Структура("ТипДокумента", ЭлементТипДокумента.ТипДокумента));
		КоличествоДокументов = НайденныеСтроки.Количество();
		СуммаРаспределенияПоДокументам = 0;
		// суммы распределения исключая последний документ
		Для Инд = 0 по КоличествоДокументов - 2 Цикл
			СуммаРаспределенияПоДокументам = СуммаРаспределенияПоДокументам + НайденныеСтроки[Инд].Сумма;	
		КонецЦикла;
		ОстатокКРаспределению = ОбщаяСуммаКРаспределению - СуммаРаспределенияПоДокументам;
		
		//НайденныеСтрокиТЧДокумента = ТабличнаяЧастьДокумента.НайтиСтроки(Новый Структура("НомерСтроки", НайденныеСтроки[КоличествоДокументов-1].НомерСтроки));
		//НайденныеСтрокиТЧДокумента[0].Сумма = ОстатокКРаспределению; 
		ТабличнаяЧастьДокумента[НайденныеСтроки[КоличествоДокументов-1].НомерСтроки - 1].Сумма = ОстатокКРаспределению;
		Если ТабличнаяЧастьДокумента[НайденныеСтроки[КоличествоДокументов-1].НомерСтроки - 1].Документ.Валюта = ВалютаОплаты Тогда
			ТабличнаяЧастьДокумента[НайденныеСтроки[КоличествоДокументов-1].НомерСтроки - 1].СуммаВВалютеДокумента = ОстатокКРаспределению;
		Иначе
			ТабличнаяЧастьДокумента[НайденныеСтроки[КоличествоДокументов-1].НомерСтроки - 1].СуммаВВалютеДокумента = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВалютаОплаты, ТабличнаяЧастьДокумента[НайденныеСтроки[КоличествоДокументов-1].НомерСтроки - 1].Документ.Валюта, ДатаОплаты, ОстатокКРаспределению);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПересчитатьИзВалютыВВалюту(ТабличнаяЧастьРаспределениеПлатежа, Знач Валюта, Знач Дата, ПересчитатьСуммуРаспределения = Ложь) Экспорт
	
	Для Каждого ТекущаяСтрока Из ТабличнаяЧастьРаспределениеПлатежа Цикл
		
		//++ №11237
		Если ПересчитатьСуммуРаспределения Тогда
			ТекущаяСтрока.Сумма = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ТекущаяСтрока.ВалютаДокумента, Валюта, Дата, ТекущаяСтрока.Сумма);
		КонецЕсли;
		//-- №11237
		
		ТекущаяСтрока.СуммаВВалютеДокумента = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(Валюта, ТекущаяСтрока.ВалютаДокумента, Дата, ТекущаяСтрока.Сумма);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОснованияПоРаспределению(ТабличнаяЧастьОснования, ТабличнаяЧастьРаспределениеПлатежа) Экспорт

	Для Каждого ТекущаяСтрока Из ТабличнаяЧастьРаспределениеПлатежа Цикл
		ТекущийДокумент = ТекущаяСтрока.Документ;
		Если НЕ ЗначениеЗаполнено(ТекущийДокумент) Тогда
			Продолжить;
		КонецЕсли;
		НайденныеСтроки = ТабличнаяЧастьОснования.НайтиСтроки(Новый Структура("Основание", ТекущийДокумент));
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = ТабличнаяЧастьОснования.Добавить();
			НоваяСтрока.Основание = ТекущийДокумент;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработкаТабличныхЧастей_ЗаказПоставщику_ПоступлениеТоваровИУслуг_ЗаказПокупателя

Процедура РаспределитьПоПотребностиЗаказДоговора(ТоварыДокумента, ТоварыРаспределение, СтруктураПараметров) Экспорт //ОбъектОснование, ОбъектСсылка) Экспорт 
	
	ОбъектОснование = СтруктураПараметров.Основание;
	ОбъектСсылка    = СтруктураПараметров.Ссылка;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	РегистрыНакопления.ОбеспечениеЗаказовРозницы.ПолучитьОстаткиКОбеспечению(МенеджерВТ, ОбъектОснование, ОбъектСсылка, СтруктураПараметров.УчетОбеспеченностиРозницыПоКомнатам);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Товары.Комната КАК Комната,
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_Товары.Коэффициент КАК Коэффициент,
	|	ВТ_Товары.Назначение КАК Назначение,
	|	ВТ_Товары.НомерПотолка КАК НомерПотолка,
	|	ВТ_Товары.КоличествоКОбеспечению КАК Количество
	|ИЗ
	|	ВТ_ТоварыКОбеспечению КАК ВТ_Товары
	|ГДЕ
	|	ВТ_Товары.КоличествоКОбеспечению > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Материалы.Комната КАК Комната,
	|	ВТ_Материалы.Номенклатура КАК Номенклатура,
	|	ВТ_Материалы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Материалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_Материалы.Коэффициент КАК Коэффициент,
	|	ВТ_Материалы.Назначение КАК Назначение,
	|	ВТ_Материалы.КоличествоКОбеспечению КАК Количество
	|ИЗ
	|	ВТ_МатериалыКОбеспечению КАК ВТ_Материалы
	|ГДЕ
	|	ВТ_Материалы.КоличествоКОбеспечению > 0";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаТоваров = РезультатЗапроса[0].Выгрузить();
	ТаблицаМатериалов = РезультатЗапроса[1].Выгрузить();
	
	Для каждого СтрокаТЧ из ТоварыДокумента  Цикл
		ОсталосьРаспределить = СтрокаТЧ.Количество;
		
		НайденныеСтроки = ТаблицаТоваров.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", СтрокаТЧ.Номенклатура, СтрокаТЧ.ХарактеристикаНоменклатуры));
		Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
			Если ОсталосьРаспределить > 0 Тогда
				НоваяСтрока = ТоварыРаспределение.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				НоваяСтрока.Количество = Мин(ОсталосьРаспределить, НайденнаяСтрока.Количество);
				ОсталосьРаспределить = ОсталосьРаспределить - НоваяСтрока.Количество;
				ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(НоваяСтрока, Ложь, Ложь);				
				НоваяСтрока.Комната = НайденнаяСтрока.Комната;
				НоваяСтрока.Назначение = "Товары";
				Если ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ЗаказПоставщику") ИЛИ ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
					НоваяСтрока.Потолок = Документы.ЗаказДоговор.ПолучитьПотолокОснованияПоНомеру(ОбъектОснование.ТоварыУслуги, НайденнаяСтрока.НомерПотолка);
				КонецЕсли;
				//++ №14311
				Если ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
					НоваяСтрока.КоличествоКВыработке = НоваяСтрока.Количество;
				КонецЕсли;
				//-- №14311
			КонецЕсли;
		КонецЦикла;
		
		НайденныеСтроки = ТаблицаМатериалов.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", СтрокаТЧ.Номенклатура, СтрокаТЧ.ХарактеристикаНоменклатуры));
		Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
			Если ОсталосьРаспределить > 0 Тогда
				НоваяСтрока = ТоварыРаспределение.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				НоваяСтрока.Количество = Мин(ОсталосьРаспределить, НайденнаяСтрока.Количество);
				ОсталосьРаспределить = ОсталосьРаспределить - НоваяСтрока.Количество;
				ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(НоваяСтрока, Ложь, Ложь);
				НоваяСтрока.Комната = НайденнаяСтрока.Комната; 
				НоваяСтрока.Назначение = "Материалы";
				//++ №14311
				Если ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
					НоваяСтрока.КоличествоКВыработке = НоваяСтрока.Количество;
				КонецЕсли;
				//-- №14311
			КонецЕсли;
		КонецЦикла;
		
		Если ОсталосьРаспределить > 0 Тогда
			НоваяСтрока = ТоварыРаспределение.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.Количество = ОсталосьРаспределить;
			ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(НоваяСтрока, Ложь, Ложь);
			//++ №14311
			Если ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				НоваяСтрока.КоличествоКВыработке = НоваяСтрока.Количество;
			КонецЕсли;
			//-- №14311
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЦеныПоставщика(Форма, ТабличнаяЧастьДокумента) Экспорт
	
	Объект = Форма.Объект;
	
	Отбор = Новый Структура;	
	
	//очистим от автоматически добавленных строк - услуг раскроя потолка поставщиком (у них заполнено поле "Потолок") и это услуга;
	НоваяТабличнаяЧасть = Новый ТаблицаЗначений;
	НоваяТабличнаяЧасть = Объект[ТабличнаяЧастьДокумента].Выгрузить();
	Объект[ТабличнаяЧастьДокумента].Очистить();
	Для Каждого ТекущаяСтрока Из НоваяТабличнаяЧасть Цикл
		Если ТекущаяСтрока.Потолок.Пустая() Тогда
			НоваяСтрока = Объект[ТабличнаяЧастьДокумента].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		Иначе
			Если НЕ Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда
				НоваяСтрока = Объект[ТабличнаяЧастьДокумента].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			КонецЕсли
		КонецЕсли;
	КонецЦикла;

	//заполняем цены 
	Для Каждого СтрокаТаблицы из Объект[ТабличнаяЧастьДокумента] Цикл
		Если ПустаяСтрока(СтрокаТаблицы.ЕдиницаИзмерения) или СтрокаТаблицы.Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда 
			Сообщить ("В строке №" + СтрокаТаблицы.НомерСтроки + " не заполнены Номенклатура или Единица измерения");
			
		ИначеЕсли НЕ Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаТаблицы.Номенклатура) И СтрокаТаблицы.Потолок.Пустая() Тогда
			СтрокаТаблицы.Цена = ПолучитьЦенуПоставщика(Объект, СтрокаТаблицы.Номенклатура, СтрокаТаблицы.ХарактеристикаНоменклатуры, СтрокаТаблицы.ЕдиницаИзмерения);
			//СтрокаТаблицы.Сумма = СтрокаТаблицы.Цена * СтрокаТаблицы.Количество;
			ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТаблицы, Ложь, Ложь, Ложь);
			ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТаблицы, Форма.УчитыватьНДС);
			
		ИначеЕсли НЕ Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаТаблицы.Номенклатура) И НЕ СтрокаТаблицы.Потолок.Пустая() Тогда
			//пропускаем, эта строка была добавлена автоматически и цены были получены ранее
			
			//#6541
			Если СтрокаТаблицы.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Материал Тогда
				СтрокаТаблицы.Цена = ПолучитьЦенуПоставщика(Объект, СтрокаТаблицы.Номенклатура, СтрокаТаблицы.ХарактеристикаНоменклатуры, СтрокаТаблицы.ЕдиницаИзмерения);
				//СтрокаТаблицы.Сумма = СтрокаТаблицы.Цена * СтрокаТаблицы.Количество;
				ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТаблицы, Ложь, Ложь, Ложь);
				ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТаблицы, Форма.УчитыватьНДС);
			КонецЕсли;
		
		Иначе
			//определим стоимость по полотну
			Номенклатура = СтрокаТаблицы.Номенклатура;
			СтоимостьЗаПолотно = 0;
			Если Номенклатура.Потолок_Фактура.Количество() = 0 Тогда
				ФактураЦвет = Справочники.Номенклатура.ПолучитьОсновнуюФактуруИЦветПотолка(Номенклатура);
				СтоимостьЗаПолотно = Номенклатура.Потолок_КоличествоРасход * РегистрыСведений.ЦеныМатериаловПоставщиков.ПолучитьЦенуМатериала(Объект.Контрагент, ФактураЦвет.ПродукцияФактура, ФактураЦвет.ПродукцияЦвет, Объект.Дата, Объект.Валюта, Номенклатура.ВидНоменклатуры, Объект.ВидЦеныПоставщика);
			Иначе
				//определяем цену многофактурного потолка
				ТаблицаЦенПоПолотну = Новый ТаблицаЗначений;
				ТаблицаЦенПоПолотну.Колонки.Добавить("Количество", Новый ОписаниеТипов("число"));
				ТаблицаЦенПоПолотну.Колонки.Добавить("Цена", Новый ОписаниеТипов("число"));
				ТаблицаЦенПоПолотну.Колонки.Добавить("Сумма", Новый ОписаниеТипов("число"));
				
				////сначала основное полотно
				//НоваяСтрока = ТаблицаЦенПоПолотну.Добавить();
				//НоваяСтрока.Количество = Номенклатура.Потолок_КоличествоРасход;
				//НоваяСтрока.Цена = РегистрыСведений.ЦеныМатериаловПоставщиков.ПолучитьЦенуМатериала(Объект.Контрагент, Номенклатура.Фактура, Номенклатура.ЦветФактуры, Объект.Дата, Объект.Валюта, Номенклатура.ВидНоменклатуры);
				//НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
				
				//потом все дополнительные
				Для Каждого ДополнительнаяФактура Из Номенклатура.Потолок_Фактура Цикл
					Цена = РегистрыСведений.ЦеныМатериаловПоставщиков.ПолучитьЦенуМатериала(Объект.Контрагент, ДополнительнаяФактура.ПродукцияФактура, ДополнительнаяФактура.ПродукцияЦвет, Объект.Дата, Объект.Валюта, Номенклатура.ВидНоменклатуры, Объект.ВидЦеныПоставщика);
					
					НоваяСтрока = ТаблицаЦенПоПолотну.Добавить();
					Если НЕ ДополнительнаяФактура.ПродукцияКоличество = 0 Тогда
						НоваяСтрока.Количество = ДополнительнаяФактура.ПродукцияКоличество;
					Иначе
						НоваяСтрока.Количество = СтрокаТаблицы.Количество * СтрокаТаблицы.Коэффициент;
					КонецЕсли;
					НоваяСтрока.Цена = Цена;
					НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
				КонецЦикла;
				ТаблицаЦенПоПолотну.Свернуть(,"Сумма");
				
				СтоимостьЗаПолотно = ТаблицаЦенПоПолотну[0].Сумма;
			КонецЕсли;
			
			//добавим стоимость услуг раскроя
			ВидЦенУслугиПроизводства = Справочники.ЦеныУслугРаскрояПоставщиков.ПолучитьДействующийПрайсПоставщикаНаУслугиПроизводства(Объект.ВидЦеныПоставщика, Объект.Дата);
			
			//УГЛЫ
			ТаблицаСтоимостиРаскроя = Новый ТаблицаЗначений;
			ТаблицаСтоимостиРаскроя.Колонки.Добавить("Номенклатура");
			ТаблицаСтоимостиРаскроя.Колонки.Добавить("Цена", Новый ОписаниеТипов("число"));
			ТаблицаСтоимостиРаскроя.Колонки.Добавить("Количество", Новый ОписаниеТипов("число"));
			ТаблицаСтоимостиРаскроя.Колонки.Добавить("Сумма", Новый ОписаниеТипов("число"));
			
			КоличествоУслугиКЗагрузке = Номенклатура.Потолок_КоличествоУглов;
			ТаблицаУслугиРаскроя = Справочники.ЦеныУслугРаскрояПоставщиков.ПолучитьТаблицуНоменклатурИЦенУглов(ВидЦенУслугиПроизводства, КоличествоУслугиКЗагрузке, Объект.Валюта, Объект.Дата);
			Для Каждого ТекущаяСтрока Из ТаблицаУслугиРаскроя Цикл
				Если НЕ ТекущаяСтрока.Количество = 0 Тогда
					НоваяСтрока = ТаблицаСтоимостиРаскроя.Добавить();
					НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
					НоваяСтрока.Количество = ТекущаяСтрока.Количество;
					НоваяСтрока.Цена = ТекущаяСтрока.Цена;
					НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
				КонецЕсли;
			КонецЦикла;
			
			//КРИВЫЕ
			КоличествоУслугиКЗагрузке = Номенклатура.Потолок_ПериметрКривых;
			ТаблицаУслугиРаскроя = Справочники.ЦеныУслугРаскрояПоставщиков.ПолучитьТаблицуНоменклатурИЦенКривых(ВидЦенУслугиПроизводства, КоличествоУслугиКЗагрузке, Объект.Валюта, Объект.Дата);
			Для Каждого ТекущаяСтрока Из ТаблицаУслугиРаскроя Цикл
				Если НЕ ТекущаяСтрока.Количество = 0 Тогда
					НоваяСтрока = ТаблицаСтоимостиРаскроя.Добавить();
					НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
					НоваяСтрока.Количество = ТекущаяСтрока.Количество;
					НоваяСтрока.Цена = ТекущаяСтрока.Цена;
					НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
				КонецЕсли;
			КонецЦикла;
			
			//ВНУТРЕННИЕ ВЫРЕЗЫ
			КоличествоУслугиКЗагрузке = Номенклатура.Потолок_ПериметрВырезов;
			ТаблицаУслугиРаскроя = Справочники.ЦеныУслугРаскрояПоставщиков.ПолучитьТаблицуНоменклатурИЦенВнутренниеВырезы(ВидЦенУслугиПроизводства, КоличествоУслугиКЗагрузке, Объект.Валюта, Объект.Дата);
			Для Каждого ТекущаяСтрока Из ТаблицаУслугиРаскроя Цикл
				Если НЕ ТекущаяСтрока.Количество = 0 Тогда
					НоваяСтрока = ТаблицаСтоимостиРаскроя.Добавить();
					НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
					НоваяСтрока.Количество = ТекущаяСтрока.Количество;
					НоваяСтрока.Цена = ТекущаяСтрока.Цена;
					НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
				КонецЕсли;
			КонецЦикла;
			
			//ВЫРЕЗЫ APPLY
			КоличествоУслугиКЗагрузке = Номенклатура.Потолок_ДлинаВырезаApply;
			ТаблицаУслугиРаскроя = Справочники.ЦеныУслугРаскрояПоставщиков.ПолучитьТаблицуНоменклатурИЦенВырезыApply(ВидЦенУслугиПроизводства, КоличествоУслугиКЗагрузке, Объект.Валюта, Объект.Дата);
			Для Каждого ТекущаяСтрока Из ТаблицаУслугиРаскроя Цикл
				Если НЕ ТекущаяСтрока.Количество = 0 Тогда
					НоваяСтрока = ТаблицаСтоимостиРаскроя.Добавить();
					НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
					НоваяСтрока.Количество = ТекущаяСтрока.Количество;
					НоваяСтрока.Цена = ТекущаяСтрока.Цена;
					НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
				КонецЕсли;
			КонецЦикла;
			
			//ФОТОПЕЧАТЬ
			КоличествоУслугиКЗагрузке = Номенклатура.Потолок_ПлощадьФотопечати;
			ТаблицаУслугиРаскроя = Справочники.ЦеныУслугРаскрояПоставщиков.ПолучитьТаблицуНоменклатурИЦенФотопечать(ВидЦенУслугиПроизводства, КоличествоУслугиКЗагрузке, Объект.Валюта, Объект.Дата);
			Для Каждого ТекущаяСтрока Из ТаблицаУслугиРаскроя Цикл
				Если НЕ ТекущаяСтрока.Количество = 0 Тогда
					НоваяСтрока = ТаблицаСтоимостиРаскроя.Добавить();
					НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
					НоваяСтрока.Количество = ТекущаяСтрока.Количество;
					НоваяСтрока.Цена = ТекущаяСтрока.Цена;
					НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
				КонецЕсли;
			КонецЦикла;
			
			//ШВЫ
			КоличествоУслугиКЗагрузке = Номенклатура.Потолок_ДлинаШвов;
			Если Номенклатура.Потолок_Фактура.Количество() > 0 Тогда
				//многофактурный
				ТаблицаУслугиРаскроя = Справочники.ЦеныУслугРаскрояПоставщиков.ПолучитьТаблицуНоменклатурИЦенДлинаШвовМногофактурный(ВидЦенУслугиПроизводства, КоличествоУслугиКЗагрузке, Объект.Валюта, Объект.Дата);
			Иначе
				//простой
				ТаблицаУслугиРаскроя = Справочники.ЦеныУслугРаскрояПоставщиков.ПолучитьТаблицуНоменклатурИЦенДлинаШвов(ВидЦенУслугиПроизводства, КоличествоУслугиКЗагрузке, Объект.Валюта, Объект.Дата);
			КонецЕсли;
			Для Каждого ТекущаяСтрока Из ТаблицаУслугиРаскроя Цикл
				Если НЕ ТекущаяСтрока.Количество = 0 Тогда
					НоваяСтрока = ТаблицаСтоимостиРаскроя.Добавить();
					НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
					НоваяСтрока.Количество = ТекущаяСтрока.Количество;
					НоваяСтрока.Цена = ТекущаяСтрока.Цена;
					НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
				КонецЕсли;
			КонецЦикла;
			
			//ПОЛЬЗОВАТЕЛЬСКИЕ ШВЫ
			КоличествоУслугиКЗагрузке = Номенклатура.Потолок_ДлинаПользовательскихШвов;
			ТаблицаУслугиРаскроя = Справочники.ЦеныУслугРаскрояПоставщиков.ПолучитьТаблицуНоменклатурИЦенДлинаПользовательскихШвов(ВидЦенУслугиПроизводства, КоличествоУслугиКЗагрузке, Объект.Валюта, Объект.Дата);
			Для Каждого ТекущаяСтрока Из ТаблицаУслугиРаскроя Цикл
				Если НЕ ТекущаяСтрока.Количество = 0 Тогда
					НоваяСтрока = ТаблицаСтоимостиРаскроя.Добавить();
					НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
					НоваяСтрока.Количество = ТекущаяСтрока.Количество;
					НоваяСтрока.Цена = ТекущаяСтрока.Цена;
					НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
				КонецЕсли;
			КонецЦикла;
			
			//ЦЕНТРОВКА ШВА
			Если Номенклатура.Потолок_ВыполненаЦентровкаШва Тогда
				КоличествоУслуги = 1;
			Иначе
				КоличествоУслуги = 0;
			КонецЕсли;
			Если КоличествоУслуги > 0 Тогда
				ПроцентСтоимостиУслуги = ВидЦенУслугиПроизводства.ПроцентНаценкиЗаЦентровкуШва;
				Если НЕ ПроцентСтоимостиУслуги = 0 Тогда
					НоваяСтрока = ТаблицаСтоимостиРаскроя.Добавить();
					НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
					НоваяСтрока.Количество = КоличествоУслуги;
					НоваяСтрока.Цена = (ТаблицаСтоимостиРаскроя.Итог("Сумма") + СтоимостьЗаПолотно) * (ПроцентСтоимостиУслуги / 100);
					НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
				КонецЕсли;
			КонецЕсли;
			
			//ИТОГ
			Если Константы.ЗаказПоставщикуВыделятьУслугиРаскрояИзПотолка.Получить() Тогда
				Для Каждого ТекущаяСтрока Из ТаблицаСтоимостиРаскроя Цикл
					Если НЕ ТекущаяСтрока.Цена = 0 Тогда
						НоваяСтрока = Объект[ТабличнаяЧастьДокумента].Добавить();
						НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
						НоваяСтрока.ЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(НоваяСтрока.Номенклатура);
						НоваяСтрока.Потолок = СтрокаТаблицы.Номенклатура;
						НоваяСтрока.Коэффициент = 1;
						НоваяСтрока.Количество = ТекущаяСтрока.Количество;
						НоваяСтрока.Цена = ТекущаяСтрока.Цена;
						//НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
						ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(НоваяСтрока, Ложь, Ложь, Ложь);
						ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока, Форма.УчитыватьНДС);
						
						НоваяСтрока.Комната = СтрокаТаблицы.Комната;       //++ #6668
						НоваяСтрока.Назначение = СтрокаТаблицы.Назначение; //++ #6668
					КонецЕсли;
				КонецЦикла;
				СтрокаТаблицы.Сумма = СтоимостьЗаПолотно;
				Если НЕ СтрокаТаблицы.Количество = 0 Тогда
					СтрокаТаблицы.Цена = СтрокаТаблицы.Сумма / СтрокаТаблицы.Количество;
				КонецЕсли;
				ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТаблицы, Форма.УчитыватьНДС);
			Иначе
				СтрокаТаблицы.Сумма = ТаблицаСтоимостиРаскроя.Итог("Сумма") + СтоимостьЗаПолотно;
				Если НЕ СтрокаТаблицы.Количество = 0 Тогда
					СтрокаТаблицы.Цена = СтрокаТаблицы.Сумма / СтрокаТаблицы.Количество;
				КонецЕсли;
				ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТаблицы, Форма.УчитыватьНДС);
			КонецЕсли;

		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЦенуПоставщика(Объект, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения)
	
	Отбор = Новый Структура;
	Отбор.Очистить();
	Отбор.Вставить("Поставщик",					 Объект.Контрагент);
	Отбор.Вставить("Валюта",					 Объект.Валюта);
	Отбор.Вставить("Номенклатура", 				 Номенклатура);
	Отбор.Вставить("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	Отбор.Вставить("ЕдиницаИзмерения", 			 ЕдиницаИзмерения);
	Отбор.Вставить("ВидЦеныПоставщика", 		 Объект.ВидЦеныПоставщика);
	Выборка = РегистрыСведений.ЦеныПоставщиков.ПолучитьПоследнее(Объект.Дата, Отбор);
	
	Возврат Выборка.Цена;
	
КонецФункции

#КонецОбласти


#Область ОбработкаТабличныхЧастей_Заполнение

Процедура ЗаполнитьТабличнуюЧастьПоГруппеНоменклатурыСервер(ПараметрыЗаполнения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГруппаНоменклатуры", ПараметрыЗаполнения.ГруппаНоменклатуры);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры,
	|	Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	1 КАК Коэффициент,
	|	1 КАК Количество
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаНоменклатуры)
	|	И НЕ Номенклатура.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|АВТОУПОРЯДОЧИВАНИЕ";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураПоиска = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка); 
		
		НайденныеСтроки = ПараметрыЗаполнения.ТабличнаяЧасть.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = ПараметрыЗаполнения.ТабличнаяЧасть.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьПоПродажамНоменклатурыПоПоставщикуСервер(ПараметрыЗаполнения) Экспорт
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПоступлениеТоваровИУслуг.Дата КАК Дата
		|ИЗ
		|	Документ.ПоступлениеТоваровИУслуг КАК ПоступлениеТоваровИУслуг
		|ГДЕ
		|	ПоступлениеТоваровИУслуг.Контрагент = &Поставщик
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Поставщик", ПараметрыЗаполнения.Поставщик);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДатаПоследнегоПоступления = ВыборкаДетальныеЗаписи.Дата;
	Иначе
		ДатаПоследнегоПоступления = Дата(1,1,1);
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Поставщик", ПараметрыЗаполнения.Поставщик);
	Запрос.УстановитьПараметр("ДатаПоследнегоПоступления", ДатаПоследнегоПоступления);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПродажиОбороты.Номенклатура КАК Номенклатура,
	|	ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПродажиОбороты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	1 КАК Коэффициент,
	|	ПродажиОбороты.КоличествоОборот КАК Количество
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&ДатаПоследнегоПоступления, , Период, Номенклатура.Поставщик = &поставщик) КАК ПродажиОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|АВТОУПОРЯДОЧИВАНИЕ";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураПоиска = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка); 
		
		НайденныеСтроки = ПараметрыЗаполнения.ТабличнаяЧасть.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = ПараметрыЗаполнения.ТабличнаяЧасть.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
